# Pandas 01 - Select rows and columns.
Seleccionar filas o columnas haciendo uso de iloc[] y loc[]

In [1]:
import pandas as pd

In [2]:
persons = {
    'Name': ['Karime', 'Karen', 'Merijuana', 'John', 'Ivan'],
    'Last': ['Zapata', 'Doe', 'Green', 'Constantine', 'Solos'],
    'Age': [22, 25, 7, 29, 39]
}
df = pd.DataFrame(persons)
df

        Name         Last  Age
0     Karime       Zapata   22
1      Karen          Doe   25
2  Merijuana        Green    7
3       John  Constantine   29
4       Ivan        Solos   39

### Acceder de manera directa a los registros
Veremos la primera opcion sin hacer uso de iloc y loc. este metodo solo puede acceder a las columnas por su nombre

In [3]:
# acceder por el nombre de atributo
df.Name

0       Karime
1        Karen
2    Merijuana
3         John
4         Ivan
Name: Name, dtype: object

In [4]:
# usar solo un par de corchetes retornara una lista.
df['Name']

0       Karime
1        Karen
2    Merijuana
3         John
4         Ivan
Name: Name, dtype: object

In [5]:
# para devolver un DataFrame debe usar doble [[]].
df[['Name']]

        Name
0     Karime
1      Karen
2  Merijuana
3       John
4       Ivan

In [6]:
# podemos mostrar mas columnas separandolas por ','.
df[['Name', 'Age']]

        Name  Age
0     Karime   22
1      Karen   25
2  Merijuana    7
3       John   29
4       Ivan   39

### Acceder a filas y columnas con iloc.
iloc recibe 2 argumentos de tipo entero.
el primer argumento hace referencia al indice o numero de fila.
el segundo hace referencia a la columna, este puede ser opcional si no se pasa ningun argumento el DataFrame retorna todas las columnas.

In [7]:
# acceder a una fila, si no se especifica la columan se retornan todas.
df.iloc[[0]]

     Name    Last  Age
0  Karime  Zapata   22

In [8]:
# seleccionar diferentes filas
df.iloc[[1,3]]

    Name         Last  Age
1  Karen          Doe   25
3   John  Constantine   29

In [9]:
# hacer uso de rebandas (slices)
df.iloc[2:3]

        Name   Last  Age
2  Merijuana  Green    7

In [10]:
df.iloc[1:3]

        Name   Last  Age
1      Karen    Doe   25
2  Merijuana  Green    7

In [11]:
# seleccionar filas y especificar columnas
# accede a la fila y devuelve el valor de la columna
df.iloc[[1], [2]]

   Age
1   25

In [12]:
# especificar mas de una fila y columna
df.iloc[[0,2], [0,1]]

        Name    Last
0     Karime  Zapata
2  Merijuana   Green

In [13]:
# ambos pueden hacer uso de slices
df.iloc[1:2, 2:3]

   Age
1   25

In [14]:
# acceder a determinada columna y devolcer todas las filas
df.iloc[:, [1]]

          Last
0       Zapata
1          Doe
2        Green
3  Constantine
4        Solos

### Acceder a filas y columnas con loc[].
a diferencia de iloc, loc puede acceder por el numero de indice y porel nombre de la columna o de indice.
loc recibe 2 argumentos, el primero el la fila que puede ser opcion.
el segundo argumento es el nombre de la columna

In [15]:
# acceder a una columna por su nombre, si se quiere ver todos las filas debe usar :
df.loc[:, ['Name']]

        Name
0     Karime
1      Karen
2  Merijuana
3       John
4       Ivan

In [16]:
# seleccionar varias columans
df.loc[:, ['Name', 'Age']]

        Name  Age
0     Karime   22
1      Karen   25
2  Merijuana    7
3       John   29
4       Ivan   39

In [17]:
# seleccionar determinadas filas y columnas
df.loc[[0,2], ['Last', 'Name']]

     Last       Name
0  Zapata     Karime
2   Green  Merijuana

Como se puede ver loc es mejor al momento de acceder a elementos de un DataFrame